{"classes": ["gender", "occassion", "type of outfit", "color", "location", "age of person"], "annotations": [" Show me a stylish denim jumpsuit for women for a casual day out with friends.\n", {"entities": [" Female", " Occasion: Casual", " Casual: The given sentence describes a \"casual day out\" with friends, so the type of outfit suggested is \"casual", " The sentence itself does not have a color", " Retail store or online shopping website, specifically focused on fashion or clothing for women", " Women: Unspecified"]}, "I'd love to see a sophisticated velvet midi dress for a formal evening event.\n", {"entities": [" Female", " Formal", " Formal / Cocktail dress (for the outfit description given, \"sophisticated velvet midi dress\" can be categorized as a formal or cocktail dress", " Purple or Black (for formal events, these colors are commonly used) but the given sentence does not specify a particular color for the dress", " Formula: (formal evening event)\nAnswer: Event", " Adult"]}, "Can you find a vibrant floral maxi skirt for a summer garden party for a young girl?\n", {"entities": [" Female", " The occasion is a \"garden party", " Floral maxi skirt", " The sentiment of the sentence is related to the color \"vibrant,\" which typically brings to mind a variety of bright and lively hues", " Stores (or: shopping) would be a good guess, as that's where one might go to find such a skirt", " Girl: Young"]}, "Show me an elegant lace blouse for a mother-of-the-bride to wear at her daughter's wedding.\n", {"entities": [" Female", " The occasion is a wedding", " The type of outfit described in the sentence is \"elegant,\" but specifically, it refers to a \"blouse\" made of \"lace", " White or Ivory", " Department store or Bridal shop", " Mother: Middle-aged or Older (since being a mother-of-the-bride typically implies having an adult child getting married)"]}, "I need to see a bold leather jacket for a fashion-forward man going to a music festival.\n", {"entities": [" Man", " The occasion is: Music Festival", " Leather (jacket)\n\nThis is because the sentence describes a \"bold leather jacket,\" which implies that the item being referred to is a type of jacket made from leather, and it is also suggested that this jacket is suitable for a man attending a music festival who wants to look fashion-forward", " The sentence does not contain a specific color mentioned in it", " Stores: A common location for purchasing fashion items like a bold leather jacket for a fashion-forward man going to a music festival", " The given sentence does not provide enough information to determine the age of the man mentioned"]}]}{"classes": ["gender", "occassion", "wearable", "color", "location", "age"], "annotations": [" Show me a stylish denim jumpsuit for women for a casual day out with friends.\n", {"entities": [" Female", " Occasion: Casual", " Jumpsuit (specifically, a denim jumpsuit)", " The color of the sentence is not explicitly stated, so it cannot be described in one word", " Retail store or online shop (for clothing or fashion) like Zara, H&M, Mango, ASOS, etc", " Modern"]}, "I'd love to see a sophisticated velvet midi dress for a formal evening event.\n", {"entities": [" Feminine", " Formal", " Dress (specifically, a midi dress made of sophisticated velvet fabric for formal events)", " The sentiment expressed in the sentence is not related to a specific color", " Formality (or Formalities) would be an appropriate single-word answer, as the sentence discusses a desire for a specific type of clothing for a formal occasion", " Modern"]}, "Can you find a vibrant floral maxi skirt for a summer garden party for a young girl?\n", {"entities": [" Female", " The occasion is a summer garden party", " Skirt (specifically, a vibrant floral maxi skirt)", " The sentiment or theme of the sentence is \"vibrant\" and \"floral,\" so the color could be described as \"Vibrant Floral\" or simply, \"Bright", " Stores (or: Shopping) - This is a general location as the sentence does not specify a particular store or online shopping platform", " The given sentence is timeless as it does not contain any specific date or age reference"]}, "Show me an elegant lace blouse for a mother-of-the-bride to wear at her daughter's wedding.\n", {"entities": [" Female", " The occasion is a wedding", " Blouse (or top, if you consider the \"wearable\" part as separate from \"lace blouse\")", " The sentence itself does not have a color as it is describing an action and requesting an object", " Department store or bridal shop", " The sentence does not provide enough information to determine its age in one word"]}, "I need to see a bold leather jacket for a fashion-forward man going to a music festival.\n", {"entities": [" The given sentence is describing a \"man,\" so it is masculine", " The occasion is: Music Festival", " Leather Jacket (or Bold Leather Jacket)", " The sentiment or meaning of the sentence does not have a direct correlation to a specific color", " Stores: A common location for buying fashion items, including bold leather jackets for men, is at retail stores or shops that specialize in fashion and apparel", " Modern"]}]}{"classes": ["gender", "occassion", "wearable", "color", "location", "age"], "annotations": [" Show me a stylish denim jumpsuit for women for a casual day out with friends.\n", {"entities": [" Female", " Occasion: Casual", " Jumpsuit (specifically, a denim jumpsuit)", " The color of the sentence is not specified", " Retail store or online shopping site (e", " Modern"]}, "I'd love to see a sophisticated velvet midi dress for a formal evening event.\n", {"entities": [" Feminine", " Formal", " Dress (specifically, a velvet midi dress for a formal evening event) would be the answer", " The sentiment or meaning of the sentence is not related to a specific color", " Formula: (formal evening event) = ball, gala, soiree, etc", " Modern"]}, "Can you find a vibrant floral maxi skirt for a summer garden party for a young girl?\n", {"entities": [" Female", " The occasion is a summer garden party", " Skirt (specifically, a vibrant floral maxi skirt)", " The sentiment or theme of the sentence is related to the colors typically found in flowers, so I would describe it as \"floral\" or \"vibrant", " Stores (or: shopping)\n\nThis is a suggestion based on the context of the sentence, as it implies looking for a specific item to purchase", " The sentence is about a summer garden party and making a comment about a young girl, so I would classify it as \"contemporary\" or \"recent"]}, "Show me an elegant lace blouse for a mother-of-the-bride to wear at her daughter's wedding.\n", {"entities": [" Female", " Wedding", " Blouse (specifically, a lace blouse)", " The sentence itself does not have a color", " Department store or bridal shop", " The sentence is timeless and does not contain any specific age reference"]}, "I need to see a bold leather jacket for a fashion-forward man going to a music festival.\n", {"entities": [" The given sentence is describing a man", " The occasion is: Music Festival", " Leather Jacket (or Bold Leather Jacket)", " The color is not explicitly mentioned in the sentence, so it cannot be determined from this information alone", " A fashion market or store, specifically one focusing on trendy or alternative clothing, would be an appropriate location for finding a bold leather jacket suitable for a fashion-forward man attending a music festival", " Modern"]}]}